# Pandas Exercise: Merging (MPG Cars)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a to a variable called cars1 and cars2

In [4]:
cars1=pd.read_csv("https://raw.githubusercontent.com/Parasj12/Python-Basics/master/Datasets/Pandas%20Exercise6%20files/cars1.csv")
cars2=pd.read_csv("https://raw.githubusercontent.com/Parasj12/Python-Basics/master/Datasets/Pandas%20Exercise6%20files/cars2.csv")

print(cars1.head())
print(cars2.head())

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70
2  18.0          8           318        150    3436          11.0     70
3  16.0          8           304        150    3433          12.0     70
4  17.0          8           302        140    3449          10.5     70

   origin                        car  Unnamed: 9  Unnamed: 10  Unnamed: 11  \
0       1  chevrolet chevelle malibu         NaN          NaN          NaN
1       1          buick skylark 320         NaN          NaN          NaN
2       1         plymouth satellite         NaN          NaN          NaN
3       1              amc rebel sst         NaN          NaN          NaN
4       1                ford torino         NaN          NaN          NaN

   Unnamed: 12  Unnamed: 13
0          NaN          NaN
1          NaN          NaN
2          NaN          NaN
3          NaN          NaN
4          NaN          NaN
    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  33.0          4            91         53    1795          17.4     76
1  20.0          6           225        100    3651          17.7     76
2  18.0          6           250         78    3574          21.0     76
3  18.5          6           250        110    3645          16.2     76
4  17.5          6           258         95    3193          17.8     76

   origin                 car
0       3         honda civic
1       1      dodge aspen se
2       1   ford granada ghia
3       1  pontiac ventura sj
4       1       amc pacer d/l

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [10]:
cars1=cars1.dropna(axis=1)
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [13]:
cars1.shape[0]

198

In [15]:
cars2.shape[0]

200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [20]:
print(cars1.columns,'\n',cars2.columns)
cars=cars1.append(cars2)
cars.head()

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model', 'origin', 'car'],
      dtype='object')
 Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model', 'origin', 'car'],
      dtype='object')

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [27]:
import numpy as np
s=np.random.randint(15000,73000,398)
s

array([36772, 61942, 65759, 41284, 40708, 43934, 52268, 32884, 51639,
       21153, 72773, 66480, 72960, 20365, 64043, 58922, 63488, 70809,
       52751, 33952, 36068, 42920, 16413, 71465, 62891, 25472, 31006,
       33164, 16695, 17336, 46414, 58693, 25485, 37021, 50295, 62756,
       58887, 43912, 45805, 54290, 56726, 25949, 60476, 22110, 30703,
       65867, 15357, 29271, 47471, 47158, 64514, 65532, 68830, 35315,
       28055, 30423, 16477, 19640, 62275, 47067, 34461, 48237, 57044,
       70741, 33213, 42765, 44166, 19082, 33422, 57009, 53544, 52112,
       44246, 27084, 23817, 49681, 71117, 23041, 44140, 64313, 61756,
       64057, 59974, 29257, 15788, 25270, 65649, 61031, 45286, 53990,
       19137, 16245, 70944, 17644, 68678, 46805, 36813, 45899, 48022,
       36303, 43540, 16123, 48487, 36925, 29113, 17839, 52889, 26886,
       69352, 42461, 28067, 44959, 21770, 15591, 26884, 16699, 47702,
       25849, 66369, 19652, 72904, 27109, 57375, 48247, 50964, 31698,
       50399, 38857, 54766, 72114, 51440, 31826, 29745, 28983, 36705,
       56413, 53885, 38353, 59001, 36302, 60520, 54958, 24414, 17349,
       49663, 60019, 46209, 23470, 46602, 58152, 55524, 34744, 70765,
       54353, 23852, 50099, 65972, 15725, 30533, 37586, 54306, 64547,
       16650, 72374, 36689, 67185, 49596, 54335, 31976, 69279, 67570,
       33535, 39252, 28664, 52956, 37989, 51817, 70330, 39208, 17192,
       45426, 72827, 71636, 31474, 25775, 26548, 34406, 18543, 40360,
       41999, 42890, 39450, 27757, 71052, 51126, 55731, 43163, 58596,
       34396, 21835, 60530, 52398, 57453, 17961, 58698, 26391, 36718,
       37790, 16525, 43767, 53075, 21823, 66852, 22213, 69176, 28385,
       60269, 22184, 45859, 26684, 33094, 15144, 30081, 34629, 46998,
       60320, 45484, 30921, 35859, 62409, 35126, 36716, 64986, 49698,
       43050, 34130, 52435, 71372, 65365, 56679, 54744, 46659, 63952,
       49123, 20862, 57925, 42466, 35001, 50950, 16084, 39629, 63569,
       46469, 34516, 51582, 55978, 63104, 69065, 37864, 69709, 67651,
       37395, 55082, 68009, 67687, 45554, 41137, 39725, 50612, 22086,
       41920, 42938, 52139, 53538, 29184, 49838, 29655, 44786, 30329,
       29344, 52220, 20015, 67495, 47757, 27272, 15398, 26336, 23193,
       69026, 53957, 52045, 60543, 35835, 53899, 40414, 36117, 60626,
       17489, 34434, 53855, 45530, 58394, 70211, 45558, 42558, 56466,
       47353, 28847, 50661, 48368, 16411, 35739, 20080, 46143, 48278,
       70571, 41384, 71722, 20079, 35325, 46675, 50818, 49652, 35696,
       49650, 15585, 56633, 61614, 33656, 61650, 15507, 51666, 22977,
       50867, 19682, 35339, 54909, 42064, 22030, 62460, 39934, 72361,
       45143, 32130, 62015, 54225, 61894, 66171, 32416, 31712, 67880,
       22522, 42519, 18635, 23326, 19932, 39462, 61652, 27265, 24847,
       32172, 40452, 30343, 60560, 20285, 25001, 42554, 32462, 39315,
       62038, 31560, 55481, 23318, 37199, 34216, 54728, 23218, 62782,
       46521, 32548, 72245, 62680, 62947, 66378, 38635, 65154, 43787,
       70923, 43306, 20347, 44825, 19820, 44777, 43246, 20412, 48373,
       19582, 21092])

### Step 8. Add the column owners to cars

In [28]:
cars['Owners']=s

In [29]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,36772
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,61942
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,65759
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,41284
4,17.0,8,302,140,3449,10.5,70,1,ford torino,40708